Documents/Реестр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Реестр</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>InformationRegister.НачальныеДанныеДоговора</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.ДатыУчетаДоговоров</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьКакНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныйОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неустойка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Госпошлина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработанФССП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатЗапросаВФССП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписанВРегистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗапросывФССПдляРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗапросывФССПдляРеестра</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗапросПослан</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатЗапросаВФССП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаAnswer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаРезультат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаБАКфайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаБакЗапрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаЗапросаНет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка_запрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайлаНаЗапрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатЗапросаВФССП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РезультатЗапросаВФССП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосланЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтрицателтныйОтветНаЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтрицательныйРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученОтветНаЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученЗапросНаРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослатьЗапрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИспДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыИспДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебныйПриказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Должники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Должники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКогдаВыдан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегионаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудСтатус</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Реестр/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Об = РеквизитФормыВЗначение("Объект");
	
	
	Объект.ПометитьКакНовые = Об.ЭтоНовый();
	
	
	 Для каждого Стр Из Объект.Должники  Цикл
	  
		 Стр.ОбработанФССП = ЗапросВРегистрПо (Объект.Ссылка, Стр.Должник);
	  
	  КонецЦикла;  

	  
	видимФСП=Новый Структура;
	
	видимФСП.Вставить("Период", Объект.Дата);
	видимФСП.Вставить("Сотрудник", ПараметрыСеанса.Пользователь);
	
	УстановитьПараметрыФункциональныхОпцийФормы(видимФСП);
	

	
КонецПроцедуры


&НаСервере
Функция ЗапросВРегистрПо (реестрстр, должстр)

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросывФССПдляРеестра.ЗапросПослан КАК ЗапросПослан
		|ИЗ
		|	РегистрСведений.ЗапросывФССПдляРеестра КАК ЗапросывФССПдляРеестра
		|ГДЕ
		|	ЗапросывФССПдляРеестра.Реестр = &Реестр
		|	И ЗапросывФССПдляРеестра.Должник = &Должник";
	
	Запрос.УстановитьПараметр("Должник", должстр);
	Запрос.УстановитьПараметр("Реестр", реестрстр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	    запрП=ВыборкаДетальныеЗаписи.ЗапросПослан;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	 Возврат запрП;

КонецФункции // ()



&НаКлиенте
Процедура ПоказатьКарточку(Команда)
	Если Элементы.Должники.ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбрана строка.", 10);
	Иначе
		СтрокаДолжника = Объект.Должники.НайтиПоИдентификатору(Элементы.Должники.ТекущаяСтрока);
		текДолжник = СтрокаДолжника.Должник;
		ПоказатьЗначение(, текДолжник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	СвернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СвернутьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	
	Об.Должники.Свернуть("Должник, Договор, ТекущийОсновнойДолг, ВсегоЗадолженность, ПросроченныеПроценты, ПросроченныйОсновнойДолг, Неустойка, ДатаРасчетаЗадолженности, ДнейПросрочки", "");
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры // ()


&НаСервере
Функция ИмяЗначенияПеречисленияПоСинониму( пИмяПеречисления, пСинонимЗначения ) Экспорт
	
	
    имя=СокрЛП(пСинонимЗначения);
    Для Каждого эл из Метаданные.Перечисления.РезультатЗапросаВФССП.ЗначенияПеречисления Цикл
        Если СокрЛП(эл.Синоним)=имя Тогда
            Возврат Вычислить("Перечисления.РезультатЗапросаВФССП."+эл.Имя);
        КонецЕсли;    
    КонецЦикла;
    Возврат Неопределено;
	
	
    
КонецФункции // Имя Значения Перечисления По Синониму



&НаСервере
Функция ИмяЗначенияПеречисленияПоСинонимуСтр( пИмяПеречисления, пСинонимЗначения ) Экспорт
	
	
   КолекцияЗначенийПеречисления = Метаданные.Перечисления[пИмяПеречисления].ЗначенияПеречисления;
    Для каждого пНайденноеЗначение из КолекцияЗначенийПеречисления Цикл
        Если пНайденноеЗначение.Синоним = пСинонимЗначения Тогда
            Возврат пНайденноеЗначение.Имя;
        КонецЕсли
    КонецЦикла;
    Возврат неопределено;	
	
    
КонецФункции // Имя Значения Перечисления По Синониму




&НаКлиенте
Процедура ЗапросВФССП(Команда)
					
	 	  
		
		 запвРег=Ложь;
		
		Для каждого Стр  Из Объект.Должники  Цикл
			
			
			
			 Если Стр.ЗаписанВРегистр="" Тогда
			 
				 
					//  проверю есть ли регион
					 
				   регЕсть= ЕстьЛиРегионУДолжника(Стр.Должник);
				   
				   Если  регЕсть Тогда
				          Стр.ЗаписанВРегистр="Записан в регистр";
				   Иначе		  
				   	     Стр.ЗаписанВРегистр="Нет региона";
				   
				   КонецЕсли;
				   
				   запвРег=Истина;    
			 
			 КонецЕсли;
			 
				 
			 //// Очистить регистр сведений
			 //Если ПереписатьФССП=Истина   Тогда
			 //    
			 //    				 
			 //       Стр.ЗаписанВРегистр="";
			 //   	
			 //   	УдалитьВРегистреСведений(Объект.Ссылка,Стр.Должник);

			 //
			 //КонецЕсли;
			 //
			 
			 
			 
			 
			 
			 
		 КонецЦикла;
		    

		    Если запвРег Тогда
			
				 ЗаписатьВРегистр();
			
			КонецЕсли;
	              
           		  
				  
	ЭтаФорма.Записать();			  
	   
	Сообщить("Ок");
	
	
КонецПроцедуры


&НаСервере
Функция ЕстьЛиРегионУДолжника(долж)

	        ссылкаРегион=Неопределено;
			
			регЕсть=Ложь;
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Должники.Регион КАК Регион
				|ИЗ
				|	Справочник.Должники КАК Должники
				|ГДЕ
				|	Должники.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", долж);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ссылкаРегион=ВыборкаДетальныеЗаписи.Регион;
				
			КонецЦикла;
			
			
			Если ссылкаРегион<>Неопределено  Тогда
				регЕсть=Истина;
				
			Иначе	
				регЕсть=Ложь;
			
			КонецЕсли;
         			

	Возврат регЕсть;		 
	

КонецФункции // ()



&НаСервере
Процедура УдалитьВРегистреСведений(реестрт, долж)

	
	
		
		      НаборЗаписей = РегистрыСведений.ЗапросывФССПдляРеестра.СоздатьНаборЗаписей(); 
				
				НаборЗаписей.Отбор.Реестр.Установить(реестрт);
				НаборЗаписей.Отбор.Должник.Установить(долж);
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество()>0 Тогда
				
					  НаборЗаписей.Удалить(0);
				
				КонецЕсли; 
				
				   
				
				НаборЗаписей.Записать();

	

КонецПроцедуры




&НаСервере
Процедура ЗаписатьВРегистр()

	      Shell = Новый COMОбъект("WScript.Shell");
          дирМоиД=Shell.SpecialFolders.Item("MyDocuments");

		   
	
	
            	Для Каждого Стр Из Объект.Должники Цикл
					 МенеджерЗаписи = РегистрыСведений.ЗапросывФССПдляРеестра.СоздатьМенеджерЗаписи();
					 
					МассивОтв= ПолучитьРегионДолжика(Стр.Должник);

					  
					ИмяФайла="C:\Distr\PR\FSSP\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst.txt"; 
					
					ИмяФайлаНет="C:\Distr\PR\FSSPNOT\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst.txt"; 
					
			   					  
				    								
					СтрЕкз="C:\Distr\FSSP\FSSPRequest.exe "+МассивОтв[0]+" "+МассивОтв[1]+" "+МассивОтв[2]+" "+СтрЗаменить(МассивОтв[3]," ", "")+" "+формат(МассивОтв[4],"ДЛФ=Д"); 
					
					
					
					СтрAnswer="C:\Distr\FSSP\FSSPAnswer.exe "+МассивОтв[1]+" "+МассивОтв[2]+" "+формат(МассивОтв[4],"ДЛФ=Д");
					
					ИмяФайлаРезультат="C:\Distr\PR\FSSPAnswer\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst___.txt";
					СтрокаБАКфайл= "C:\Distr\PR\FSSBAK\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst___.txt"; 
					
					СтрокаБакЗапрос="C:\Distr\PR\FSSPZ\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst.txt"; 
					
					
					  // если нет региона не пишу в регистр
					  
					   Если МассивОтв[0]<>"" Тогда
					   
					   	    МенеджерЗаписи.Реестр = Объект.Ссылка;
							МенеджерЗаписи.Должник = Стр.Должник;
							МенеджерЗаписи.ЗапросПослан=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Послать запрос" );
							МенеджерЗаписи.СтрокаЗапроса = СтрЕкз;
							МенеджерЗаписи.ИмяФайлаНаЗапрос=ИмяФайла;
							МенеджерЗаписи.СтрокаAnswer=СтрAnswer;
							МенеджерЗаписи.СтрокаРезультат=ИмяФайлаРезультат;
							МенеджерЗаписи.СтрокаБАКфайл=СтрокаБАКфайл;
							МенеджерЗаписи.СтрокаБакЗапрос=СтрокаБакЗапрос;
							
							МенеджерЗаписи.СтрокаЗапросаНет=ИмяФайлаНет;
							
							МенеджерЗаписи.Записать();

						Иначе
							Сообщить(Стр.Должник);
					   
					   КонецЕсли;  
					  
													
				КонецЦикла;
	
		
КонецПроцедуры






&НаКлиенте
Процедура ПолучитьОтвет()
	
	
	
	Shell = Новый COMОбъект("WScript.Shell");
    дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
	

	Оповещение = Новый ОписаниеОповещения("ОповещениеК", ЭтотОбъект);

	       //  пройдусь получу ответ
	
    Для каждого Стр2  Из Объект.Должники  Цикл
	
		
		
		  МассивОтв2= ПолучитьРегионДолжика(Стр2.Должник);

		  // проверю есть ли файл ответ 
		  //    string namefile = firstname + "-" + lastname+ "-" + birthdate + "reqFirst.txt";
		  
		       ИмяФайла=дирМоиД+"\FSSP\firstname="+ МассивОтв2[1]+ "-lastname="+ МассивОтв2[2]+ "-birthdate="+ формат(МассивОтв2[4],"ДЛФ=Д")+"reqFirst.txt"; 
			   
			   ИмяФайлаОтриц=дирМоиД+"\FSSPNOT\firstname="+ МассивОтв2[1]+ "-lastname="+ МассивОтв2[2]+ "-birthdate="+ формат(МассивОтв2[4],"ДЛФ=Д")+"reqFirst.txt"; 
			   
			   ИмяФайлаПерем=дирМоиД+"\FSSPZ\firstname="+ МассивОтв2[1]+ "-lastname="+ МассивОтв2[2]+ "-birthdate="+ формат(МассивОтв2[4],"ДЛФ=Д")+"reqFirst.txt"; 
			   
			   //Сообщить(ИмяФайла);
		  
		       Файл = Новый Файл(ИмяФайла);

			   ФайлОтр= Новый Файл(ИмяФайлаОтриц);
		
			Если  Файл.Существует() Тогда	
					 //  отправлю запрос на результат и запишу что пришел ответ на запрос
				 //    
				 //СтрЕкз="C:\Distr\FSSP\FSSPAnswer.exe "+МассивОтв2[1]+" "+МассивОтв2[2]+" "+формат(МассивОтв2[4],"ДЛФ=Д"); 
				 //
				 //НачатьЗапускПриложения(Оповещение,СтрЕкз);
				 
				 
				 
				 
				  Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Получен ответ на запрос" ); 
				  
				  
				 
				  
				 
			 Иначе
				 // а есть ли отрицательный ответ
				 
				 
			   	  Если ФайлОтр.Существует() Тогда
				  
					   Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Отрицателтный ответ на запрос" );
				  
				  КонецЕсли;
				 
				 
				 //Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Не обработан" );
		 
				 
		         			
					
			КонецЕсли;
				  
			
		
			
			// Перенести файлы
				  
			//ПереместитьФайл(ИмяФайла, ИмяФайлаПерем); // перезапишет, если уже есть такой файл
     		
		//
		//Сообщить(Стр2.Должник);
		//  
		//Сообщить(формат(МассивОтв2[4],"ДЛФ=Д"));
		//Сообщить(МассивОтв2[0]);

		
	КонецЦикла;
	
	
    ЭтаФорма.Записать();	
	

КонецПроцедуры


&НаКлиенте
Процедура ПослатьЗапросНаРезультат()

	
	
		
	Shell = Новый COMОбъект("WScript.Shell");
    дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
	

	Оповещение = Новый ОписаниеОповещения("ОповещениеК", ЭтотОбъект);

	       //  пройдусь получу ответ
	
    Для каждого Стр2  Из Объект.Должники  Цикл
	
		
		
		  МассивОтв2= ПолучитьРегионДолжика(Стр2.Должник);

		  // проверю есть ли файл ответ 
		  //    string namefile = firstname + "-" + lastname+ "-" + birthdate + "reqFirst.txt";
		  
		       ИмяФайла=дирМоиД+"\FSSP\firstname="+ МассивОтв2[1]+ "-lastname="+ МассивОтв2[2]+ "-birthdate="+ формат(МассивОтв2[4],"ДЛФ=Д")+"reqFirst.txt"; 
			   
			   ИмяФайлаОтриц=дирМоиД+"\FSSPNOT\firstname="+ МассивОтв2[1]+ "-lastname="+ МассивОтв2[2]+ "-birthdate="+ формат(МассивОтв2[4],"ДЛФ=Д")+"reqFirst.txt"; 
			   
			   ИмяФайлаПерем=дирМоиД+"\FSSPZ\firstname="+ МассивОтв2[1]+ "-lastname="+ МассивОтв2[2]+ "-birthdate="+ формат(МассивОтв2[4],"ДЛФ=Д")+"reqFirst.txt"; 
			   
			   //Сообщить(ИмяФайла);
		  
		       Файл = Новый Файл(ИмяФайла);

			   ФайлОтр= Новый Файл(ИмяФайлаОтриц);
		
			Если  Файл.Существует() И  НЕ (Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Обработан" )) И НЕ (Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Получен запрос на результат" ))  Тогда	
					 //  отправлю запрос на результат и запишу что пришел ответ на запрос
					 
					 
				 //    
				 СтрЕкз="C:\Distr\FSSP\FSSPAnswer.exe "+МассивОтв2[1]+" "+МассивОтв2[2]+" "+формат(МассивОтв2[4],"ДЛФ=Д"); 
				 //
				 НачатьЗапускПриложения(Оповещение,СтрЕкз,,Истина);
				 
				 
				 
				 
				  Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Получен запрос на результат" ); 
				  
				  
				  //ПереместитьФайл(ИмяФайла, ИмяФайлаПерем); // перезапишет, если уже есть такой файл
				  
			

				  
				 
			 Иначе
				 // а есть ли отрицательный ответ
				 
				 
			   	  Если ФайлОтр.Существует() Тогда
				  
				  	   Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Отрицателтный ответ на запрос" );
				  
				  КонецЕсли;
				 
				 
				 //Стр2.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Не обработан" );
		 
				 
		         			
					
			КонецЕсли;
				  
			
		
			
			 //Перенести файлы
				  
			     		
		//
		//Сообщить(Стр2.Должник);
		//  
		//Сообщить(формат(МассивОтв2[4],"ДЛФ=Д"));
		//Сообщить(МассивОтв2[0]);

		
	КонецЦикла;
	
	
    ЭтаФорма.Записать();	
	
	
	//
	//    	 
	//	 СтрЕкз="C:\Distr\FSSP\FSSPAnswer.exe "+МассивОтв2[1]+" "+МассивОтв2[2]+" "+формат(МассивОтв2[4],"ДЛФ=Д"); 
	//	 
	// 	 НачатьЗапускПриложения(Оповещение,СтрЕкз);


КонецПроцедуры



&НаКлиенте
Процедура ОбработатьОтвет()

	       Shell = Новый COMОбъект("WScript.Shell");
           дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
		   
		   //Оповещение = Новый ОписаниеОповещения("ОповещениеА", ЭтотОбъект);

		   //  обработаю ответы
		   
		   
		   
		   exe_production="";
		   details="";
		   subject_fssp="";
		   department="";
		   bailiff="";
		   ip_end="";
		   
		   
		    Для каждого Стр3  Из Объект.Должники  Цикл

				   МассивОтв3= ПолучитьРегионДолжика(Стр3.Должник);
				   
				   СсылкаДолж=Стр3.Должник;

		   // проверю есть ли файл результат 
		  //    string namefile = firstname + "-" + lastname+ "-" + birthdate + "reqFirst.txt";
		  
		  
		     ИмяФайла=дирМоиД+"\FSSPAnswer\firstname="+ МассивОтв3[1]+ "-lastname="+ МассивОтв3[2]+ "-birthdate="+ формат(МассивОтв3[4],"ДЛФ=Д")+"reqFirst___.txt"; 
			 ИмяФайлаПерем=дирМоиД+"\FSSBAK\firstname="+ МассивОтв3[1]+ "-lastname="+ МассивОтв3[2]+ "-birthdate="+ формат(МассивОтв3[4],"ДЛФ=Д")+"reqFirst___.txt"; 
			 ИмяФайлаОтрицОтв=дирМоиД+"\FSSPAnswerResultNOT\firstname="+ МассивОтв3[1]+ "-lastname="+ МассивОтв3[2]+ "-birthdate="+ формат(МассивОтв3[4],"ДЛФ=Д")+"reqFirst___.txt"; 
			 
			   
			  Файл = Новый Файл(ИмяФайла);
 
			  обраб=Ложь;


		        Если  Файл.Существует()  И  НЕ (Стр3.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Обработан" )) Тогда	
				
					
						//   try
						
				
						
						
					     //Сообщить(ИмяФайла);
						  
								    разм=Файл.Размер();
									
									Если разм<>0 Тогда
									
										
											мСтрокФайла = Новый Массив();
											
											//прочитать строку считывает одну строку из файла
											//если достигнут конец файла, то возвращается значение НЕОПРЕДЕЛЕНО
											
											 
											ПрочитанныйТекст = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
											
											Строка = ПрочитанныйТекст.ПрочитатьСтроку();
											//а не был ли файл пуст?
											Если Строка <> Неопределено Тогда
											     мСтрокФайла.Добавить(Строка);
											КонецЕсли;
											
											Пока Строка <> Неопределено Цикл
					                           Строка = ПрочитанныйТекст.ПрочитатьСтроку();
											     Если Строка <> Неопределено Тогда
											          мСтрокФайла.Добавить(Строка);
											     КонецЕсли;
											КонецЦикла;
																	
											ПрочитанныйТекст.Закрыть();
											
											
										    номерстр=0;
											Для каждого стрф  Из  мСтрокФайла Цикл
												
											 //Сообщить("номер строки= "+ номерстр);	
												 
											  // Подготовлю строку для записи в ФССП
											  Если (НЕ СокрЛП(стрф)="{") И (НЕ СокрЛП(стрф)="}") И (НЕ СокрЛП(стрф)="}&{") Тогда
											  
												  
												  Если  номерстр=2 Тогда
													  // вытащу подстраку exe_production
													  exe_production=ВытащуПодстроку("exe_production", стрф);
													  
													  //Сообщить(exe_production);
												  КонецЕсли; 
												  
												  Если  номерстр=3 Тогда
													  
													  details=ВытащуПодстроку("details", стрф);
													  
													  
													  // Если исп лист или Судебный приказ вытащу для Исполнительные документы
													  
													   СтрукИсп=ВытащитьИспДок (стрф);
													   
													   ОписаниеДок= стрф;
													   
													   // Запишу в Исполнительные документы
													   
													  									   
													   //ЗаписьВИсполнительныеДокументы(СсылкаДолж,СтрукИсп.ВидИспДокумента,НомерИспДок,ДатаИспДок,ОписаниеДок)

													     
													   
													   
													   //Сообщить(СтрукИсп.НомерИспДок);
													   
													   //Сообщить(СтрукИсп.ДатаИспДок);
													   
													  
													 
												  КонецЕсли; 
												  
												  
												  
												   Если  номерстр=4 Тогда
													  
													 subject_fssp =ВытащуПодстроку("subject", стрф);
													  
													  ОписаниеДок=ОписаниеДок+" - " + стрф;
										
												   КонецЕсли; 
												  
												   
												   Если  номерстр=5 Тогда
													  
													  department=ВытащуПодстроку("department", стрф);
										
												   КонецЕсли; 
												  
				                                   Если  номерстр=6 Тогда
													  
													  bailiff=ВытащуПодстроку("bailiff", стрф);
											
												   КонецЕсли; 
												   
												   
												   Если  номерстр=7 Тогда
													  
													  ip_end=ВытащуПодстроку("ip_end", стрф);
											
												   КонецЕсли; 
												   
												  //Сообщить(стрф+" - номер строки="+номерстр);
													 
											  
											  КонецЕсли; 
											  
											  
																	  
											  Если номерстр=8 Тогда
											      
												  
												  //Сообщить(стрф+" --------");
												  
																  //ИмяЗначенияПеречисленияПоСинониму( "ВидыИспДокументов", "Исполнительный лист")
												  
								          				  Если СтрукИсп.ВидИспДокумента="Исполнительный лист" ИЛИ СтрукИсп.ВидИспДокумента="Судебный приказ"  Тогда
													  
															  
															 перечислен= ИмяЗначенияПеречисленияПоСинонимуСтр( "ВидыИспДокументов", СтрукИсп.ВидИспДокумента);
															  

														    ЗаписьВИсполнительныеДокументы(СсылкаДолж, перечислен ,СтрукИсп.НомерИспДок,СтрукИсп.ДатаИспДок,ОписаниеДок);

													  
													   
													   КонецЕсли;

												  
												  
												  
													 ЗаписатьВФССП (СсылкаДолж,exe_production,details,subject_fssp,department,bailiff,ip_end);
													
													 
													 
													 
													 номерстр=0;						  
													
													
													
											  КонецЕсли;
											  
											  
											  
											  
											  
											  //ЗаписатьВФССП (СсылкаДолж,exe_production,details,subject_fssp,department,bailiff,ip_end)
										     		
					                         номерстр=номерстр+1;							 
											
											КонецЦикла;						
																	
																			
							
							Иначе
							
								
							
						КонецЕсли;
					
					  обраб=Истина;		
							
					  
					  
					  
					  Стр3.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Обработан" ); 		
					
					//   Удалю файл
					 ПереместитьФайл(ИмяФайла, ИмяФайлаПерем); // перезапишет, если уже есть такой файл
					 
					 //УдалитьФайлы(ИмяФайла);
					 
					 	//Перемещу файл запроса
								
					    		ИмяФайлаЗапрос=дирМоиД+"\FSSP\firstname="+ МассивОтв3[1]+ "-lastname="+ МассивОтв3[2]+ "-birthdate="+ формат(МассивОтв3[4],"ДЛФ=Д")+"reqFirst.txt"; 
					    		ИмяФайлаПеремЗапрос=дирМоиД+"\FSSPZ\firstname="+ МассивОтв3[1]+ "-lastname="+ МассивОтв3[2]+ "-birthdate="+ формат(МассивОтв3[4],"ДЛФ=Д")+"reqFirst.txt"; 
								
								 ФайлЗапрос = Новый Файл(ИмяФайлаЗапрос);

								
								Если ФайлЗапрос.Существует() Тогда
								     ПереместитьФайл(ИмяФайлаЗапрос, ИмяФайлаПеремЗапрос); // перезапишет, если уже есть такой файл
								
								КонецЕсли;
								

				  
				 //try
			 
				 
 			Иначе
				
				ФайлОтрРез = Новый Файл(ИмяФайлаОтрицОтв);

				
				 Если ФайлОтрРез.Существует() Тогда
				 
				 	   Стр3.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Отрицательный результат" );
					   
				   Иначе
					   //Стр3.ОбработанФССП=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Послан запрос" );
 
				 
				 КонецЕсли;
				
				 
				 //Стр3.ОбработанФССП="Не обработан"; 
				 
				 
		         			
					
			КонецЕсли;
				  

			
		    	Если  обраб  Тогда
			           	
				
					УдалитьФайлы(ИмяФайла);

				
				КонецЕсли;
			
			
			    ЭтаФорма.Записать();	

			 
				   
				
    	     КонецЦикла;
	  
		   
	

КонецПроцедуры


&НаКлиенте
Функция ВытащуПодстроку(КлючПодстр, СтрИсх)
	
	  позиц=Найти(СтрИсх,":");
	  
	  ДлинаСтр=СтрДлина(СтрИсх);
	  СтрВозврат="";
	  
	  Если позиц<>0 Тогда
		  
		  позиц=позиц+3;
		  
		  СколькоВырез=ДлинаСтр-позиц-1;
		  
		  СтрВозврат=Сред(СтрИсх,позиц,СколькоВырез);
	 	
	  
	  КонецЕсли;
	  
	  
	  Возврат СтрВозврат;
	

КонецФункции // ()


&НаКлиенте
Функция ВытащитьИспДок (ИсхСтрокаИспДок)

	СтруктураСостояния = Новый Структура;

	
	 поз=Найти(ИсхСтрокаИспДок,"Исполнительный");
	
	 Если поз<>0 Тогда
		 
	     СтруктураСостояния.Вставить("ВидИспДокумента", "Исполнительный лист"); 	 
	 
	 КонецЕсли;  
	
     позс=Найти(ИсхСтрокаИспДок,"Судебный"); 	 
	 
	 Если позс<>0 Тогда
		 
	     СтруктураСостояния.Вставить("ВидИспДокумента", "Судебный приказ"); 	 
		 
		  
		 
		 
	 КонецЕсли;  
	 
	 
	 позса=Найти(ИсхСтрокаИспДок,"Акт");
	 
	 Если позса<>0 Тогда
		 
		 
		 СтруктураСостояния.Вставить("ВидИспДокумента", "Акт"); 	 
		 
	 Иначе
		 
		 Если позса=0 и позс=0 и поз=0 Тогда
		 
		 	   СтруктураСостояния.Вставить("ВидИспДокумента", "Акт"); 
		 
		 КонецЕсли;
		 
			 
		 
		 
	 КонецЕсли; 
	 
	 
	 
	 
	 
	
	 // вытащу дату    от   №
	 
	  поз=Найти(ИсхСтрокаИспДок,"от");
	  позс=Найти(ИсхСтрокаИспДок,"№");
	  
	  
	  
	  датаДок=Сред(ИсхСтрокаИспДок,поз,позс-поз);
	  СтруктураСостояния.Вставить("ДатаИспДок", датаДок);
	  
	 	  
	  // вытащить номер  
	  
	  
	              
				  длинаСтр=СтрДлина(ИсхСтрокаИспДок);
				  
				  трен=длинаСтр-позс;
				  
				  
				  стрдоНомера=Прав(ИсхСтрокаИспДок,трен-1);
				  
				   //стрдоНомера - строка после первого №
				   //  надо найти /d/s
				   
				  
				  номерДок=ДоПробелаСцифрой(стрдоНомера);
				  
				  
				  СтруктураСостояния.Вставить("НомерИспДок", номерДок);

	  
		
    Возврат СтруктураСостояния; 	

КонецФункции // ()


&НаКлиенте
Функция ДоПробелаСцифрой (стрсприц)

	  позициск=0;
	
	Для итр = 1 По СтрДлина(стрсприц) Цикл 
        Символ = Сред(стрсприц, итр, 1);
		
        Если ЭтоЦифра(Символ) Тогда 
			
			 // проверю следующий пробел?
			   СимволПр = Сред(стрсприц, итр+1, 1);
			   
			   КодСимвола = КодСимвола(СимволПр);
			   Если КодСимвола=32  Тогда
	              позициск=итр+1;
				  
				  Возврат  Лев(стрсприц,позициск);
			   
			   КонецЕсли;	
		КонецЕсли; 
		
	КонецЦикла; 	

КонецФункции // ()



&НаКлиенте
Функция ЭтоЦифра(Символ) 
    КодСимвола = КодСимвола(Символ); 
    Возврат (КодСимвола >= 48 И КодСимвола <= 57) 
КонецФункции



&НаСервере
Процедура ЗаписьВИсполнительныеДокументы(СсылкаДолж,ВидИспДок,НомерИспДок,ДатаИспДок,ОписаниеДок)

			
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсполнительныеДокументы.ВидИспДокумента КАК ВидИспДокумента,
		|	ИсполнительныеДокументы.НомерИсДок КАК НомерИсДок,
		|	ИсполнительныеДокументы.ДатаИспДок КАК ДатаИспДок,
		|	ИсполнительныеДокументы.Должник КАК Должник
		|ИЗ
		|	Справочник.ИсполнительныеДокументы КАК ИсполнительныеДокументы
		|ГДЕ
		|	ИсполнительныеДокументы.Должник = &Должник
		|	И ИсполнительныеДокументы.НомерИсДок = &НомерИсДок
		|	И ИсполнительныеДокументы.ДатаИспДок = &ДатаИспДок";
	
	
	Запрос.УстановитьПараметр("ДатаИспДок", ДатаИспДок);
	Запрос.УстановитьПараметр("Должник", СсылкаДолж);
	Запрос.УстановитьПараметр("НомерИсДок", НомерИспДок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	колЭлем= ВыборкаДетальныеЗаписи.Количество();

	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
			
	КонецЦикла;
	
	   Если колЭлем=0 Тогда
	   
	   	         			  
				   СпрИспДок=Справочники.ИсполнительныеДокументы;
				   НовЭл = СпрИспДок.СоздатьЭлемент();
				   НовЭл.Должник=СсылкаДолж;
				   
				   Если ВидИспДок=ИмяЗначенияПеречисленияПоСинонимуСтр( "ВидыИспДокументов", "Исполнительный лист") Тогда
				   
				   	    НовЭл.ВидИспДокумента=Перечисления.ВидыИспДокументов.ИсполнительныйЛист;

				   
				   Иначе
				   
				   	     НовЭл.ВидИспДокумента=Перечисления.ВидыИспДокументов.СудебныйПриказ;
				   
				   КонецЕсли;
					   
				    НовЭл.НомерИсДок=НомерИспДок;
					НовЭл.ДатаИспДок=ДатаИспДок;
					НовЭл.ОписаниеИспДокумента=ОписаниеДок;
		            НовЭл.Записать();

	   
	   КонецЕсли; 
	
						  					  
						  
	  
КонецПроцедуры




&НаСервере
Процедура ЗаписатьВФССП (СсылкаДолж,exe_production,details,subject_fssp,department,bailiff,ip_end)

	
	//   Проверить была ли такая запись?
	   
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФССП.exe_production КАК exe_production,
		|	ФССП.details КАК details
		|ИЗ
		|	Справочник.ФССП КАК ФССП
		|ГДЕ
		|	ФССП.Должник = &Должник
		|	И ФССП.exe_production ПОДОБНО &exe_production";
	
	Запрос.УстановитьПараметр("exe_production", exe_production);
	Запрос.УстановитьПараметр("Должник", СсылкаДолж);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	колСтр=ВыборкаДетальныеЗаписи.Количество();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	
	      Если колСтр=0 Тогда
		  
		  	      									  
						СпрФССП=Справочники.ФССП;
						НовЭлем=СпрФССП.СоздатьЭлемент();
						НовЭлем.Должник=СсылкаДолж;
						НовЭлем.exe_production=exe_production;
						НовЭлем.details=details;
						НовЭлем.subject_fssp=subject_fssp;
				   		НовЭлем.department=department;
						НовЭлем.bailiff=bailiff;
						НовЭлем.ip_end=ip_end;
						НовЭлем.Записать();	   			  
						  

		  
		  КонецЕсли;
				
						
КонецПроцедуры





&НаКлиенте
Процедура ОповещениеК(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        Сообщить("Первый запрос");
    КонецЕсли;	
 
КонецПроцедуры






&НаСервере
Функция ПолучитьРегионДолжика(Ссылка)

	 МассивДолж = Новый Массив(5);
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должники.Фамилия КАК Фамилия,
		|	Должники.Имя КАК Имя,
		|	Должники.Отчество КАК Отчество,
		|	Должники.ДатаРождения КАК ДатаРождения,
		|	Должники.Регион.Наименование КАК РегионНаименование,
    	|	Регионы.КодРегионаФССП КАК КодРегионаФССП
		|ИЗ
		|	Справочник.Должники КАК Должники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Регионы КАК Регионы
		|		ПО Должники.Регион = Регионы.Ссылка
		|ГДЕ
		|	Должники.Ссылка = &Ссылка";

		
	//	|ИЗ
	//	|	Справочник.Должники КАК Должники
	//	|ГДЕ
	//	|	Должники.Ссылка = &Ссылка";
	//
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
			  МассивДолж[2]=ВыборкаДетальныеЗаписи.Фамилия;
		  МассивДолж[1]=ВыборкаДетальныеЗаписи.Имя;
		  МассивДолж[3]=ВыборкаДетальныеЗаписи.Отчество;
		  МассивДолж[4]=ВыборкаДетальныеЗаписи.ДатаРождения;
		  МассивДолж[0]=ВыборкаДетальныеЗаписи.КодРегионаФССП;

		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА




	//
	//	  МассивДолж[0]=ВыборкаДетальныеЗаписи.Фамилия;
	//	  МассивДолж[1]=ВыборкаДетальныеЗаписи.Имя;
	//	  МассивДолж[2]=ВыборкаДетальныеЗаписи.Отчество;
	//	  МассивДолж[3]=ВыборкаДетальныеЗаписи.ДатаРождения;
	//	  МассивДолж[4]=ВыборкаДетальныеЗаписи.РегионКод;
	  //Регионы.КодРегионаФССП КАК КодРегионаФССП
	
	Возврат  МассивДолж;
	
	
	


	
	
	

КонецФункции // ()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры


&НаСервере
Процедура УдалитьИзРегистраНаСервере()
	// Вставить содержимое обработчика.
	
	 
   НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
   
    Сч = 0;

	остаткЗап=Объект.Должники.Количество();
	 
	колЗап=Объект.Должники.Количество(); 

	
	Для каждого Стр  Из Объект.Должники  Цикл
		
		      
		 
		
					Стр.ЗаписанВРегистр="";
			    	
			    	УдалитьВРегистреСведений(Объект.Ссылка,Стр.Должник);

		
		 Сч = Сч + 1;
		//Если колЗап<100 Тогда
		//    ЗафиксироватьТранзакцию();
		//	//НачатьТранзакцию();
		//
		//КонецЕсли;
	  
	    Если Сч = 100 Тогда
	    	ЗафиксироватьТранзакцию();
			НачатьТранзакцию();
			Сч=0;
	    КонецЕсли;	
		
		Если колЗап-Сч<100 Тогда
		
			  ЗафиксироватьТранзакцию();
			  НачатьТранзакцию();
		КонецЕсли;
		
		
		Если остаткЗап<=100 Тогда
		
			  ЗафиксироватьТранзакцию();
			  НачатьТранзакцию();
		КонецЕсли;
		
		
		
		остаткЗап=остаткЗап-1;

		
    КонецЦикла;
	
	  
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьИзРегистра(Команда)
			
	УдалитьИзРегистраНаСервере();
	
	ЭтаФорма.Записать();

КонецПроцедуры


&НаКлиенте
Процедура КтоНеЗаписанВРегистр(Команда)
	
	  сч=0;
	
	   Для каждого Стр  Из Объект.Должники  Цикл
          
		   
		  
			   
			        реготв= КтоНеЗаписанВРегистрФССП (Объект.Ссылка, Стр.Должник);

					Если НЕ реготв Тогда
					
						  Стр.ЗаписанВРегистр=""; 
						  
					КонецЕсли;

			   
		  
		   
       КонецЦикла;
	   

	   ЭтаФорма.Записать();			  
	   
	Сообщить("Ок");

	
КонецПроцедуры


&НаСервере
Функция КтоНеЗаписанВРегистрФССП (реестрт, долж)

	
	           	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
		
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	   кол=0;
	   нетзаписи=Ложь;
	   
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗапросывФССПдляРеестра.КЗ КАК КЗ
				|ИЗ
				|	РегистрСведений.ЗапросывФССПдляРеестра КАК ЗапросывФССПдляРеестра
				|ГДЕ
				|	ЗапросывФССПдляРеестра.Реестр = &Реестр
				|	И ЗапросывФССПдляРеестра.Должник = &Должник";
			
			Запрос.УстановитьПараметр("Должник", долж);
			Запрос.УстановитьПараметр("Реестр", реестрт);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			кол= ВыборкаДетальныеЗаписи.Количество();

	   
	   
	   
	   
	   
	   //
	   //         НаборЗаписей = РегистрыСведений.ЗапросывФССПдляРеестра.СоздатьНаборЗаписей(); 
	   // 		
	   // 	НаборЗаписей.Отбор.Реестр.Установить(реестрт);
	   // 		НаборЗаписей.Отбор.Должник.Установить(долж);
	   // 		
	   // 		НаборЗаписей.Прочитать();

	   //        кол=НаборЗаписей.Количество();
			   
	  Если кол=0 Тогда
	  
	  	   нетзаписи=Ложь;
	  
	  Иначе
	  
	  	   нетзаписи=Истина;
	  
	  КонецЕсли;		   
			   
	  Возврат нетзаписи;
	  
КонецФункции // ()

&НаКлиенте
Процедура ЗаписатьВФССППустые(Команда)
	
        
	
	  	Для каждого Стр  Из Объект.Должники  Цикл

			
			   Если Стр.ЗаписанВРегистр="" Тогда
				   
				   
				   	 
				   регЕсть= ЕстьЛиРегионУДолжника(Стр.Должник);
				   
				   Если  регЕсть Тогда
				          Стр.ЗаписанВРегистр="Записан в регистр";
				   Иначе		  
				   	     Стр.ЗаписанВРегистр="Нет региона";
				   
				   КонецЕсли;

				   
				   
				    ЗаписатьВРегистрОдного(Стр.Должник);

			          	
			
			 
               КонецЕсли;

			
			
			  	
			
        КонецЦикла;

	    ЭтаФорма.Записать();			  
	   
	Сообщить("Ок");

	
КонецПроцедуры



&НаСервере
Процедура ЗаписатьВРегистрОдного(долж)

		  //Shell = Новый COMОбъект("WScript.Shell");
		  //дирМоиД=Shell.SpecialFolders.Item("MyDocuments");

		   
	
	 		
					МенеджерЗаписи = РегистрыСведений.ЗапросывФССПдляРеестра.СоздатьМенеджерЗаписи();
					 
					МассивОтв= ПолучитьРегионДолжика(долж);

					  
					ИмяФайла="C:\Distr\PR\FSSP\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst.txt"; 
					
					ИмяФайлаНет="C:\Distr\PR\FSSPNOT\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst.txt"; 
					
			   					  
				    								
					СтрЕкз="C:\Distr\FSSP\FSSPRequest.exe "+МассивОтв[0]+" "+МассивОтв[1]+" "+МассивОтв[2]+" "+СтрЗаменить(МассивОтв[3]," ", "")+" "+формат(МассивОтв[4],"ДЛФ=Д"); 
					
					
					
					СтрAnswer="C:\Distr\FSSP\FSSPAnswer.exe "+МассивОтв[1]+" "+МассивОтв[2]+" "+формат(МассивОтв[4],"ДЛФ=Д");
					
					ИмяФайлаРезультат="C:\Distr\PR\FSSPAnswer\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst___.txt";
					СтрокаБАКфайл= "C:\Distr\PR\FSSBAK\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst___.txt"; 
					
					СтрокаБакЗапрос="C:\Distr\PR\FSSPZ\firstname="+ МассивОтв[1]+ "-lastname="+ МассивОтв[2]+ "-birthdate="+ формат(МассивОтв[4],"ДЛФ=Д")+"reqFirst.txt"; 
					
					
					  // если нет региона не пишу в регистр
					  
					   Если МассивОтв[0]<>"" Тогда
					   
					   	      МенеджерЗаписи.Реестр = Объект.Ссылка;
							МенеджерЗаписи.Должник = долж;
							МенеджерЗаписи.ЗапросПослан=ИмяЗначенияПеречисленияПоСинониму( "РезультатЗапросаВФССП", "Послать запрос" );
							МенеджерЗаписи.СтрокаЗапроса = СтрЕкз;
							МенеджерЗаписи.ИмяФайлаНаЗапрос=ИмяФайла;
							МенеджерЗаписи.СтрокаAnswer=СтрAnswer;
							МенеджерЗаписи.СтрокаРезультат=ИмяФайлаРезультат;
							МенеджерЗаписи.СтрокаБАКфайл=СтрокаБАКфайл;
							МенеджерЗаписи.СтрокаБакЗапрос=СтрокаБакЗапрос;
							
							МенеджерЗаписи.СтрокаЗапросаНет=ИмяФайлаНет;
							
							МенеджерЗаписи.Записать();

					   
					   КонецЕсли;  
					  
//													
				
		
КонецПроцедуры
